#ifndef __ESP8266_H
#define __ESP8266_H

#ifndef NULL
#define NULL (void *)0
#endif


/**********************************************************************
 * 函数名称： AddNetDeviceESP8266
 * 功能描述： 注册ESP8266网卡设备
 * 输入参数： 无
 * 输出参数： 无
 * 返 回 值： 无
 * 修改日期       版本号     修改人	      修改内容
 * -----------------------------------------------
 * 2021/10/14	     V1.0	  韦东山	      创建
 ***********************************************************************/
void AddNetDeviceESP8266(void);

#endif /* __ESP8266_H */

